Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53N19A.atdf
        <module name="FREQM" id="U2257" version="1.1.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="5"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.2.0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PA30"/>
              <signal group="IO" index="0" function="M" pad="PB14"/>
              <signal group="IO" index="0" function="M" pad="PA14"/>
              <signal group="IO" index="0" function="M" pad="PB22"/>
              <signal group="IO" index="1" function="M" pad="PB15"/>
              <signal group="IO" index="1" function="M" pad="PA15"/>
              <signal group="IO" index="1" function="M" pad="PB23"/>
              <signal group="IO" index="1" function="M" pad="PA27"/>
              <signal group="IO" index="2" function="M" pad="PA16"/>
              <signal group="IO" index="2" function="M" pad="PB16"/>
              <signal group="IO" index="3" function="M" pad="PA17"/>
              <signal group="IO" index="3" function="M" pad="PB17"/>
              <signal group="IO" index="4" function="M" pad="PA10"/>
              <signal group="IO" index="4" function="M" pad="PB10"/>
              <signal group="IO" index="4" function="M" pad="PB18"/>
              <signal group="IO" index="5" function="M" pad="PA11"/>
              <signal group="IO" index="5" function="M" pad="PB11"/>
              <signal group="IO" index="5" function="M" pad="PB19"/>
              <signal group="IO" index="6" function="M" pad="PB12"/>
              <signal group="IO" index="6" function="M" pad="PB20"/>
              <signal group="IO" index="7" function="M" pad="PB13"/>
              <signal group="IO" index="7" function="M" pad="PB21"/>
            </signals>
            <parameters>
              <param name="GENCTRL0_RESETVALUE" value="106"/>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="12"/>
              <param name="GEN_NUM_MSB" value="11"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8"/>
              <param name="IO_NUM" value="8"/>
              <param name="NUM" value="48"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="9"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" id="U2005" version="1.0.0">
          <instance name="GMAC">
            <register-group name="GMAC" name-in-module="GMAC" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="GCOL" function="L" pad="PC21"/>
              <signal group="GCRS" function="L" pad="PA16"/>
              <signal group="GMDC" function="L" pad="PA20"/>
              <signal group="GMDC" function="L" pad="PB14"/>
              <signal group="GMDC" function="L" pad="PC11"/>
              <signal group="GMDIO" function="L" pad="PA21"/>
              <signal group="GMDIO" function="L" pad="PB15"/>
              <signal group="GMDIO" function="L" pad="PC12"/>
              <signal group="GRX" index="0" function="L" pad="PA13"/>
              <signal group="GRX" index="1" function="L" pad="PA12"/>
              <signal group="GRX" index="2" function="L" pad="PC15"/>
              <signal group="GRX" index="3" function="L" pad="PC14"/>
              <signal group="GRXCK" function="L" pad="PC18"/>
              <signal group="GRXDV" function="L" pad="PC20"/>
              <signal group="GRXER" function="L" pad="PA15"/>
              <signal group="GTX" index="0" function="L" pad="PA18"/>
              <signal group="GTX" index="1" function="L" pad="PA19"/>
              <signal group="GTX" index="2" function="L" pad="PC16"/>
              <signal group="GTX" index="3" function="L" pad="PC17"/>
              <signal group="GTXCK" function="L" pad="PA14"/>
              <signal group="GTXEN" function="L" pad="PA17"/>
              <signal group="GTXER" function="L" pad="PC19"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="2.1.4">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x4100C000"/>
            <parameters>
              <param name="MASTER_NUM" value="8"/>
              <param name="MASTER_CM4_S" value="0"/>
              <param name="MASTER_CMCC" value="1"/>
              <param name="MASTER_PICOP_MEM" value="2"/>
              <param name="MASTER_PICOP_IO" value="3"/>
              <param name="MASTER_DMAC_DTWR" value="4"/>
              <param name="MASTER_DMAC_DTRD" value="5"/>
              <param name="MASTER_ICM" value="6"/>
              <param name="MASTER_DSU" value="7"/>
              <param name="SLAVE_NUM" value="15"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_FLASH_ALT" value="1"/>
              <param name="SLAVE_SEEPROM" value="2"/>
              <param name="SLAVE_RAMCM4S" value="3"/>
              <param name="SLAVE_RAMPPPDSU" value="4"/>
              <param name="SLAVE_RAMDMAWR" value="5"/>
              <param name="SLAVE_RAMDMACICM" value="6"/>
              <param name="SLAVE_HPB0" value="7"/>
              <param name="SLAVE_HPB1" value="8"/>
              <param name="SLAVE_HPB2" value="9"/>
              <param name="SLAVE_HPB3" value="10"/>
              <param name="SLAVE_SDHC0" value="12"/>
              <param name="SLAVE_SDHC1" value="13"/>
              <param name="SLAVE_QSPI" value="14"/>
              <param name="SLAVE_BKUPRAM" value="15"/>
              <param name="INSTANCE_ID" value="38"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="U2010" version="1.2.0">
          <instance name="ICM">
            <register-group name="ICM" name-in-module="ICM" address-space="base" offset="0x42002C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="I2S" id="U2224" version="2.0.0">
          <instance name="I2S">
            <register-group name="I2S" name-in-module="I2S" address-space="base" offset="0x43002800"/>
            <signals>
              <signal group="FS" index="0" function="J" pad="PA09"/>
              <signal group="FS" index="0" function="J" pad="PA20"/>
              <signal group="FS" index="1" function="J" pad="PA23"/>
              <signal group="FS" index="1" function="J" pad="PB11"/>
              <signal group="MCK" index="0" function="J" pad="PA08"/>
              <signal group="MCK" index="0" function="J" pad="PB17"/>
              <signal group="MCK" index="1" function="J" pad="PB13"/>
              <signal group="SCK" index="0" function="J" pad="PA10"/>
              <signal group="SCK" index="0" function="J" pad="PB16"/>
              <signal group="SCK" index="1" function="J" pad="PB12"/>
              <signal group="SDI" function="J" pad="PA22"/>
              <signal group="SDI" function="J" pad="PB10"/>
              <signal group="SDO" function="J" pad="PA11"/>
              <signal group="SDO" function="J" pad="PA21"/>
            </signals>
            <parameters>
              <param name="CLK_NUM" value="2"/>
              <param name="MAX_SLOTS" value="8"/>
              <param name="MAX_WL_BITS" value="32"/>
              <param name="SER_NUM" value="2"/>
              <param name="INSTANCE_ID" value="106"/>
            </parameters>
          </instance>
        </module>
