Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53N19A.atdf
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="USB_" caption="USB APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="CMCC_" caption="CMCC APB Protect Enable" mask="0x8"/>
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x10"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x20"/>
          <bitfield name="HMATRIX_" caption="HMATRIX APB Protect Enable" mask="0x40"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x80"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x200"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x400"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x800"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TAL_" caption="TAL APB Protect Enable" mask="0x8000"/>
          <bitfield name="RAMECC_" caption="RAMECC APB Protect Enable" mask="0x10000"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="GMAC_" caption="GMAC APB Protect Enable" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC5_" caption="TC5 APB Protect Enable" mask="0x40"/>
          <bitfield name="PDEC_" caption="PDEC APB Protect Enable" mask="0x80"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x100"/>
          <bitfield name="AES_" caption="AES APB Protect Enable" mask="0x200"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x400"/>
          <bitfield name="ICM_" caption="ICM APB Protect Enable" mask="0x800"/>
          <bitfield name="PUKCC_" caption="PUKCC APB Protect Enable" mask="0x1000"/>
          <bitfield name="QSPI_" caption="QSPI APB Protect Enable" mask="0x2000"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x4000"/>
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM7_" caption="SERCOM7 APB Protect Enable" mask="0x8"/>
          <bitfield name="TCC4_" caption="TCC4 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC6_" caption="TC6 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC7_" caption="TC7 APB Protect Enable" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x80"/>
          <bitfield name="ADC1_" caption="ADC1 APB Protect Enable" mask="0x100"/>
          <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x200"/>
          <bitfield name="I2S_" caption="I2S APB Protect Enable" mask="0x400"/>
          <bitfield name="PCC_" caption="PCC APB Protect Enable" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PCC" id="U2017" version="1.1.0" caption="Parallel Capture Controller">
      <register-group name="PCC" caption="Parallel Capture Controller">
        <register name="MR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="PCEN" caption="Parallel Capture Enable" mask="0x1"/>
          <bitfield name="DSIZE" caption="Data size" mask="0x30"/>
          <bitfield name="SCALE" caption="Scale data" mask="0x100"/>
          <bitfield name="ALWYS" caption="Always Sampling" mask="0x200"/>
          <bitfield name="HALFS" caption="Half Sampling" mask="0x400"/>
          <bitfield name="FRSTS" caption="First sample" mask="0x800"/>
          <bitfield name="ISIZE" caption="Input Data Size" mask="0x70000"/>
          <bitfield name="CID" caption="Clear If Disabled" mask="0xC0000000"/>
        </register>
        <register name="IER" offset="0x4" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="IDR" offset="0x8" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Disable" mask="0x2"/>
        </register>
        <register name="IMR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Mask" mask="0x2"/>
        </register>
        <register name="ISR" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Status" mask="0x2"/>
        </register>
        <register name="RHR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Reception Holding Register">
          <bitfield name="RDATA" caption="Reception Data" mask="0xFFFFFFFF"/>
        </register>
