Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53N19A.atdf
      <value-group name="SUPC_VREG__SEL">
        <value name="LDO" caption="LDO selection" value="0x0"/>
        <value name="BUCK" caption="Buck selection" value="0x1"/>
      </value-group>
      <value-group name="SUPC_VREF__SEL">
        <value name="1V0" caption="1.0V voltage reference typical value" value="0x0"/>
        <value name="1V1" caption="1.1V voltage reference typical value" value="0x1"/>
        <value name="1V2" caption="1.2V voltage reference typical value" value="0x2"/>
        <value name="1V25" caption="1.25V voltage reference typical value" value="0x3"/>
        <value name="2V0" caption="2.0V voltage reference typical value" value="0x4"/>
        <value name="2V2" caption="2.2V voltage reference typical value" value="0x5"/>
        <value name="2V4" caption="2.4V voltage reference typical value" value="0x6"/>
        <value name="2V5" caption="2.5V voltage reference typical value" value="0x7"/>
      </value-group>
      <value-group name="SUPC_BBPS__CONF">
        <value name="BOD33" caption="The power switch is handled by the BOD33" value="0x0"/>
        <value name="FORCED" caption="In Backup Domain, the backup domain is always supplied by battery backup power" value="0x1"/>
      </value-group>
    </module>
    <module name="TAL" id="U2253" version="2.0.0" caption="Trigger Allocator">
      <register-group name="CPUIRQS" size="0x20">
        <register name="CPUIRQS" offset="0x0" rw="R" size="4" count="5" initval="0x00000000" caption="Interrupt Status m for CPU n">
          <bitfield name="CPUIRQS" caption="Interrupt Requests for CPU n" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="CTIS" size="0x2">
        <register name="CTICTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Cross-Trigger Interface n Control A">
          <bitfield name="BRK" caption="Action when global break issued" mask="0x3" values="TAL_CTICTRLA__BRK"/>
          <bitfield name="RESTART" caption="Action when global restart issued" mask="0x4" values="TAL_CTICTRLA__RESTART"/>
          <bitfield name="IPS" caption="Action when inter-process resource freed" mask="0x8" values="TAL_CTICTRLA__IPS"/>
        </register>
        <register name="CTIMASK" offset="0x1" rw="RW" size="1" initval="0x00" caption="Cross-Trigger Interface n Mask">
          <bitfield name="CPU0" caption="CPU 0 Break Master" mask="0x1"/>
          <bitfield name="CPU1" caption="CPU 1 Break Master" mask="0x2"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
      </register-group>
      <register-group name="SMASKS" size="0x8">
        <register name="SMASK" offset="0x0" rw="RW" size="4" count="2" initval="0x00000000" caption="Inter-Process Signal Mask m for CPU n">
          <bitfield name="IPS0" caption="Inter-Process Signal 0" mask="0x1"/>
          <bitfield name="IPS1" caption="Inter-Process Signal 1" mask="0x2"/>
          <bitfield name="IPS2" caption="Inter-Process Signal 2" mask="0x4"/>
          <bitfield name="IPS3" caption="Inter-Process Signal 3" mask="0x8"/>
          <bitfield name="IPS4" caption="Inter-Process Signal 4" mask="0x10"/>
          <bitfield name="IPS5" caption="Inter-Process Signal 5" mask="0x20"/>
          <bitfield name="IPS6" caption="Inter-Process Signal 6" mask="0x40"/>
          <bitfield name="IPS7" caption="Inter-Process Signal 7" mask="0x80"/>
          <bitfield name="IPS8" caption="Inter-Process Signal 8" mask="0x100"/>
          <bitfield name="IPS9" caption="Inter-Process Signal 9" mask="0x200"/>
          <bitfield name="IPS10" caption="Inter-Process Signal 10" mask="0x400"/>
          <bitfield name="IPS11" caption="Inter-Process Signal 11" mask="0x800"/>
          <bitfield name="IPS12" caption="Inter-Process Signal 12" mask="0x1000"/>
          <bitfield name="IPS13" caption="Inter-Process Signal 13" mask="0x2000"/>
          <bitfield name="IPS14" caption="Inter-Process Signal 14" mask="0x4000"/>
          <bitfield name="IPS15" caption="Inter-Process Signal 15" mask="0x8000"/>
          <bitfield name="IPS16" caption="Inter-Process Signal 16" mask="0x10000"/>
          <bitfield name="IPS17" caption="Inter-Process Signal 17" mask="0x20000"/>
          <bitfield name="IPS18" caption="Inter-Process Signal 18" mask="0x40000"/>
          <bitfield name="IPS19" caption="Inter-Process Signal 19" mask="0x80000"/>
          <bitfield name="IPS20" caption="Inter-Process Signal 20" mask="0x100000"/>
          <bitfield name="IPS21" caption="Inter-Process Signal 21" mask="0x200000"/>
          <bitfield name="IPS22" caption="Inter-Process Signal 22" mask="0x400000"/>
          <bitfield name="IPS23" caption="Inter-Process Signal 23" mask="0x800000"/>
          <bitfield name="IPS24" caption="Inter-Process Signal 24" mask="0x1000000"/>
          <bitfield name="IPS25" caption="Inter-Process Signal 25" mask="0x2000000"/>
          <bitfield name="IPS26" caption="Inter-Process Signal 26" mask="0x4000000"/>
          <bitfield name="IPS27" caption="Inter-Process Signal 27" mask="0x8000000"/>
          <bitfield name="IPS28" caption="Inter-Process Signal 28" mask="0x10000000"/>
          <bitfield name="IPS29" caption="Inter-Process Signal 29" mask="0x20000000"/>
          <bitfield name="IPS30" caption="Inter-Process Signal 30" mask="0x40000000"/>
          <bitfield name="IPS31" caption="Inter-Process Signal 31" mask="0x80000000"/>
        </register>
      </register-group>
      <register-group name="TAL" caption="Trigger Allocator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="EXTCTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="External Break Control">
          <bitfield name="ENABLE" caption="Enable BRK Pin" mask="0x1"/>
          <bitfield name="INV" caption="Invert BRK Pin" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="BRKEI" caption="Break Input Event Enable" mask="0x1"/>
          <bitfield name="BRKEO" caption="Break Output Event Enable" mask="0x2"/>
          <bitfield name="IRQMONEO0" caption="Interrupt Request Monitor 0 Output Event Enable" mask="0x4"/>
        </register>
